{
  "songs": [
    


    {
      "id": "helena",
      "title": "Helena",
      "interpretation": "Habla del dolor crudo por la muerte de alguien amado, mezclado con culpa, rabia y amor no dicho. No es solo despedida: es reproche por no haber estado más cerca y miedo a que esa pérdida marque para siempre al que sigue vivo.",
      "blocks": [
        {
          "label": "VERSO 1: LA CARROZA",
          "en": "Long ago\nJust like the Hearse you die to get in again\nWe are so far from you",
          "es_text": "Hace mucho\nIgual que la carroza fúnebre a la que mueres por subir de nuevo\nEstamos tan lejos de ti",
          "context": "La ironía mórbida. 'Die to get in' (morirse por entrar) es literal y figurado. La distancia ('so far') marca el escenario: tú estás en la muerte, nosotros aquí."
        },
        {
          "label": "VERSO 1 (CONT): EL INCENDIO",
          "en": "Burning on\nJust like the match you strike to incinerate\nThe lives of everyone you know",
          "es_text": "Ardiendo\nIgual que el fósforo que enciendes para incinerar\nLas vidas de todos los que conoces",
          "context": "La metáfora del daño colateral. Tú eres el fósforo, nosotros somos lo que se quema. Reconoce que la forma de vivir (o morir) de esta persona destruyó a su entorno."
        },
        {
          "label": "PRE-CORO: EL CORAZÓN ROTO",
          "en": "And what's the worst you take\nFrom every heart you break?\nAnd like the blade you'll stain\nWell, I've been holding on tonight",
          "es_text": "¿Y qué es lo peor que te llevas\nDe cada corazón que rompes?\nY como la hoja (cuchilla) que mancharás\nBueno, me he estado aferrando esta noche",
          "context": "Pregunta retórica sobre el egoísmo del dolor. 'Holding on' es la resistencia vital: a pesar del corte ('blade'), yo sigo aquí aguantando."
        },
        {
          "label": "CORO 1: LA NEGACIÓN",
          "en": "What's the worst that I can say?\nThings are better if I stay\nSo long and goodnight\nSo long, not goodnight",
          "es_text": "¿Qué es lo peor que puedo decir?\nQue las cosas son mejores si me quedo\nHasta siempre y buenas noches\nHasta siempre, NO buenas noches",
          "context": "El rechazo del cierre. Al decir 'NOT goodnight', te despides ('so long'), pero te niegas a desearle descanso. Es una despedida amarga."
        },
        {
          "label": "VERSO 2: EL DOLOR VENDIDO",
          "en": "Came a time\nWhen every star fall\nBrought you to tears again\nWe are the very hurt you sold",
          "es_text": "Llegó un momento\nEn que cada caída de estrella\nTe hacía llorar de nuevo\nSomos el dolor mismo que vendiste",
          "context": "Acusación brutal. 'We are the very hurt you sold'. Implica traición. Ya no es que estén lejos, es que son el producto de un daño comercializado o manipulado por ella."
        },
        {
          "label": "PRE-CORO 2: REPETICIÓN TÉCNICA",
          "en": "And what's the worst you take\nFrom every heart you break?\nAnd like a blade you'll stain\nWell, I've been holding on tonight",
          "es_text": "¿Y qué es lo peor que te llevas...?\n(Repetición del mantra de resistencia)",
          "context": "La segunda vuelta sirve para coger impulso antes del coro doble. Enfócate en la entonación de 'holding on'."
        },
        {
          "label": "CORO 2: LA EXTENSIÓN",
          "en": "What's the worst that I can say?\nThings are better if I stay\nSo long and goodnight\nSo long and goodnight\nWell, if you carry on this way\nThings are better if I stay\nSo long and goodnight\nSo long and goodnight",
          "es_text": "...Que las cosas son mejores si me quedo\n(Repetición)\nBueno, si sigues de esta manera\nLas cosas son mejores si me quedo...",
          "context": "Aquí se introduce el condicional 'If you carry on this way' (Si sigues así). Es una negociación. Si tú sigues muriendo/haciendo daño, yo me quedo aquí (vivo) para compensarlo."
        },
        {
          "label": "PUENTE: EL REENCUENTRO (CARS COLLIDE)",
          "en": "Can you hear me?\nAre you near me?\nCan we pretend to leave and then\nWe'll meet again\nWhen both our cars collide",
          "es_text": "¿Puedes oírme?\n¿Estás cerca de mí?\n¿Podemos fingir que nos vamos y luego\nNos encontraremos de nuevo\nCuando nuestros autos colisionen?",
          "context": "El clímax narrativo. La verdad es el choque futuro ('cars collide'), el reencuentro violento en el más allá."
        },
        {
          "label": "CORO FINAL: EL CIERRE",
          "en": "What's the worst that I can say?\nThings are better if I stay\nSo long and goodnight\nSo long and goodnight\nAnd if you carry on this way\nThings are better if I stay\nSo long and goodnight\nSo long and goodnight",
          "es_text": "(Repetición final del himno de despedida)",
          "context": "La catarsis final. Aquí ya no importa la lógica, solo gritar la despedida para sacarla del sistema."
        }
      ]
    },
    {
      "id": "im_not_okay",
      "title": "I'm Not Okay (I Promise)",
      "interpretation": "La Sátira de la Salud Mental. Es un himno sobre la presión de fingir normalidad. La canción narra el colapso mental de alguien que intenta desesperadamente convencer a los demás (y a sí mismo) de que está bien, hasta que la fachada se rompe gritando la verdad.",
      "blocks": [
        {
          "label": "VERSO 1: LA FALSA HONESTIDAD",
          "en": "Well, if you wanted honesty, that's all you had to say\nI never want to let you down or have you go, it's better off this way",
          "es_text": "Bueno, si querías honestidad, eso es todo lo que tenías que decir\nNunca quise defraudarte o dejarte ir, es mejor así",
          "context": "El inicio sarcástico. Ofrece 'honestidad' como una amenaza, no como un regalo. 'Better off this way' implica que decir la verdad va a doler y causar distancia, pero ya no puede contenerla."
        },
        {
          "label": "VERSO 1 (CONT): EL RECUERDO SUCIO",
          "en": "For all the dirty looks, the photographs your boyfriend took\nRemember when you broke your foot from jumping out the second floor?",
          "es_text": "Por todas las miradas sucias, las fotos que tomó tu novio\n¿Recuerdas cuando te rompiste el pie saltando del segundo piso?",
          "context": "Realidad vs. Imagen. Contrasta las fotos perfectas que toma el 'novio' con la realidad sucia y dolorosa de romperse un hueso por una estupidez adolescente. Es un anclaje a la memoria física real."
        },
        {
          "label": "CORO: EL AGOTAMIENTO",
          "en": "I'm not okay\nI'm not okay\nI'm not okay\nYou wear me out",
          "es_text": "No estoy bien\nNo estoy bien\nNo estoy bien\nMe estás agotando",
          "context": "La tesis central. 'You wear me out' (me agotas) es clave. No es solo tristeza, es el cansancio extremo de mantener la máscara social. Repetirlo 3 veces rompe el estigma de admitirlo."
        },
        {
          "label": "VERSO 2: LA HIPOCRESÍA",
          "en": "What will it take to show you that it's not the life it seems? (I'm not okay)\nI've told you time and time again\nYou sing the words, but don't know what it means (I'm not okay)",
          "es_text": "¿Qué hará falta para mostrarte que no es la vida que parece?\nTe lo he dicho una y otra vez\nCantas la letra, pero no sabes lo que significa",
          "context": "Ataque a la superficialidad. Critica a quienes consumen su dolor como entretenimiento ('sing the words') sin entender el sufrimiento real detrás ('don't know what it means')."
        },
        {
          "label": "VERSO 2 (CONT): LA ÚLTIMA MIRADA",
          "en": "To be a joke, and look, another line without a hook\nI held you close as we both shook\nFor the last time, take a good hard look",
          "es_text": "Ser un chiste, y mira, otra línea sin gancho comercial\nTe abracé fuerte mientras ambos temblábamos\nPor última vez, mira bien de cerca",
          "context": "Intimidad tóxica. 'Shook' (temblar) sugiere miedo compartido, ansiedad o abstinencia. Pide que lo miren 'for the last time' porque sabe que después de esta confesión, todo terminará."
        },
        {
          "label": "CORO 2: REPETICIÓN",
          "en": "I'm not okay\nI'm not okay\nI'm not okay\nYou wear me out (out)",
          "es_text": "(Repetición del mantra de agotamiento)",
          "context": "Mantén la energía alta. El '(out)' final es un grito extendido, preparando el terreno para el colapso del puente."
        },
        {
          "label": "PUENTE: EL LIBRO ROTO",
          "en": "Forget about the dirty looks\nThe photographs your boyfriend took\nYou said you read me like a book\nBut the pages all are torn and frayed",
          "es_text": "Olvida las miradas sucias\nLas fotos que tomó tu novio\nDijiste que me leías como a un libro\nPero las páginas están todas rotas y deshilachadas",
          "context": "La imposibilidad de ser entendido. La gente cree conocerlo ('read me like a book'), pero él está demasiado dañado ('torn and frayed') para ser legible. Faltan páginas de su historia, por eso nadie lo entiende."
        },
        {
          "label": "MANIC BREAKDOWN: LA MENTIRA",
          "en": "I'm okay, I'm okay!\nI'm okay now (I'm okay now)\nBut you really need to listen to me\nBecause I'm telling you the truth\nI mean this, I'm okay! (Trust me)",
          "es_text": "¡Estoy bien, estoy bien!\nEstoy bien ahora...\nPero realmente necesitas escucharme\nPorque te estoy diciendo la verdad\nLo digo en serio, ¡estoy bien! (Confía en mí)",
          "context": "EL QUIEBRE PSICÓTICO. Es el momento narrativo más importante. La insistencia maníaca y desesperada ('Trust me', 'Really need to listen') revela que es una mentira absoluta. Está tratando de convencerse a sí mismo para no colapsar. Actúalo con desesperación, no con calma."
        },
        {
          "label": "OUTRO: LA VERDAD CRUDA",
          "en": "I'm not okay\nI'm not okay\nWell, I'm not okay, I'm not o-fucking-kay\nI'm not okay\nI'm not okay (okay)",
          "es_text": "No estoy bien\nNo estoy bien\nBueno, no estoy bien, ¡no estoy jodidamente bien!\nNo estoy bien...",
          "context": "La liberación. La fachada se cae definitivamente. Después de mentir diciendo que estaba bien, explota con el 'Not o-fucking-kay'. Es la catarsis final de la rabia contenida."
        }
      ]
    },
    {
      "id": "cancer",
      "title": "Cancer",
      "interpretation": "Bio-Horror y Dignidad Terminal. Es la canción más física del álbum. El 'Paciente' narra su descomposición en tiempo real. No pide salvación, pide agua y que no lo miren. El terror real aquí no es la muerte, es la pérdida de la identidad física y la vergüenza de que sus seres queridos lo vean 'empapado' y deteriorado.",
      "blocks": [
        {
          "label": "VERSO 1: LA VERGÜENZA FÍSICA",
          "en": "Turn away\nIf you could get me a drink\nOf water 'cause my lips are chapped and faded",
          "es_text": "Date la vuelta\nSi pudieras traerme un trago\nDe agua, porque mis labios están agrietados y descoloridos",
          "context": "La escena abre con una necesidad biológica básica (sed) mezclada con vergüenza. Pide agua, pero primero ordena 'Turn away' (date la vuelta). No quiere que vean su rostro seco y moribundo. Prioriza ocultar su deterioro sobre su propia hidratación."
        },
        {
          "label": "VERSO 2: LA LOGÍSTICA FINAL",
          "en": "Call my aunt Marie\nHelp her gather all my things\nAnd bury me\nIn all my favorite colors",
          "es_text": "Llama a mi tía Marie\nAyúdala a recoger todas mis cosas\nY entiérrame\nCon todos mis colores favoritos",
          "context": "La aceptación administrativa. El paciente pasa de la sed inmediata a organizar su propio funeral. 'Favorite colors' es un grito desesperado de identidad: quiere ser recordado como era (con color/vida), no como el cuerpo gris que es ahora."
        },
        {
          "label": "PRE-CORO: EL CONTAGIO EMOCIONAL",
          "en": "My sisters and my brothers, still\nI will not kiss you\n'Cause the hardest part of this\nIs leaving you",
          "es_text": "Mis hermanas y mis hermanos, aun así\nNo los besaré\nPorque la parte más difícil de esto\nEs dejarlos",
          "context": "El rechazo del contacto. Dice 'I will not kiss you' posiblemente por miedo irracional a contagiarlos (lógica de enfermo), por repulsión hacia sí mismo, o para empezar a crear distancia emocional. Establece la tesis: el dolor físico es soportable, la separación ('leaving you') no."
        },
        {
          "label": "CORO: EL BIO-REALISMO",
          "en": "Now turn away\n'Cause I'm awful just to see\n'Cause all my hair's abandoned all my body",
          "es_text": "Ahora date la vuelta\nPorque soy horrible de ver\nPorque todo mi cabello ha abandonado todo mi cuerpo",
          "context": "El horror visual. Personifica su cabello ('hair's abandoned me'), como si su propia biología estuviera huyendo de él. Se describe a sí mismo como 'awful' (horrible/espantoso). Confirma que la orden de 'Turn away' es por pura estética del horror."
        },
        {
          "label": "CORO (CONT): EL FUTURO PERDIDO",
          "en": "All my agony\nKnow that I will never marry\nBaby I'm just soggy from the chemo\nBut counting down the days to go",
          "es_text": "Toda mi agonía\nSabelo, que nunca me casaré\nBebé, estoy empapado por la quimio\nPero contando los días para irme",
          "context": "'Soggy' (empapado/blando) es la palabra más visceral de la canción: evoca sudor frío, fluidos y toxicidad química. 'Never marry' es la comprensión de la línea de tiempo truncada: el duelo por la vida adulta que nunca tendrá."
        },
        {
          "label": "VERSO 3: LA NO-VIDA",
          "en": "It just ain't living\nAnd I just hope you know\nThat if you say (if you say)\nGood-bye today (good-bye today)\nI'd ask you to be true (I'd ask you to be true)",
          "es_text": "Esto simplemente no es vida\nY solo espero que sepas\nQue si dices (si dices)\nAdiós hoy (adiós hoy)\nTe pediría que fueras sincero...",
          "context": "La eutanasia pasiva. Estar conectado a máquinas y 'soggy' no cumple con la definición de 'vivir'. Pide veracidad en la despedida. No quiere falsas esperanzas ni lástima, solo un adiós honesto."
        },
        {
          "label": "OUTRO: LA VERDAD NUCLEAR",
          "en": "'Cause the hardest part of this\nIs leaving you\n'Cause the hardest part of this\nIs leaving you",
          "es_text": "Porque la parte más difícil de esto\nEs dejarte\nPorque la parte más difícil de esto\nEs dejarte",
          "context": "La conclusión axiomática. Después de describir labios agrietados, falta de cabello y quimioterapia, concluye que nada de eso importa. El amor duele más que el cáncer. La repetición final es suave, como si se quedara dormido (o muriera) al decirlo."
        }
      ]
    },
    {
      "id": "dont_love_you",
      "title": "I Don't Love You",
      "interpretation": "La Balada del Desahucio. No es una ruptura amorosa, es una expulsión. La letra revela una relación marcada por deudas ('owe'), violencia ('beating', 'blood') y desprecio ('good-for-nothing'). El protagonista no está llorando la pérdida; está echando a alguien tóxico de su vida y desafiándolo a tener la dignidad de admitir que el amor murió.",
      "blocks": [
        {
          "label": "VERSO 1: EL DESAHUCIO",
          "en": "Well, when you go\nDon't ever think I'll make you try to stay\nAnd maybe when you get back\nI'll be off to find another way",
          "es_text": "Bueno, cuando te vayas\nNunca pienses que te obligaré a intentar quedarte\nY quizás cuando vuelvas\nYo ya me habré ido a buscar otro camino",
          "context": "La puerta abierta. 'Don't ever think I'll make you try to stay' elimina el poder de la otra persona. No habrá súplicas. Es una declaración de indiferencia absoluta ante su partida."
        },
        {
          "label": "VERSO 1 (CONT): LA DEUDA",
          "en": "And after all this time that you still owe\nYou're still a good-for-nothing, I don't know\nSo take your gloves and get out\nBetter get out while you can",
          "es_text": "Y después de todo este tiempo que aún debes\nSigues siendo una inútil, no lo sé\nAsí que toma tus guantes y lárgate\nMejor lárgate mientras puedas",
          "context": "El insulto directo. 'Good-for-nothing' (inútil/bueno para nada) y 'owe' (deber) transforman el amor en una transacción fallida. 'Take your gloves' sugiere que la pelea ha terminado o que hace frío fuera (literal y metafóricamente). La amenaza 'while you can' implica que la paciencia se ha agotado."
        },
        {
          "label": "CORO 1: LA PREGUNTA FRÍA",
          "en": "When you go, and would you even turn to say\n\"I don't love you like I did yesterday\"?",
          "es_text": "Cuando te vayas, ¿te girarías siquiera para decir\n\"No te amo como lo hice ayer\"?",
          "context": "El desafío de honestidad. No pide amor, pide la verdad. Nota el uso de 'did yesterday' (como lo *hice* ayer). Cuestiona si la otra persona tiene la decencia de admitir el final a la cara."
        },
        {
          "label": "VERSO 2: LA VIOLENCIA",
          "en": "Sometimes I cry so hard from pleading\nSo sick and tired of all the needless beating\nBut baby, when they knock you down and out\nIs where you oughta stay",
          "es_text": "A veces lloro tanto de suplicar\nTan harto y cansado de toda la paliza innecesaria\nPero nena, cuando te noqueen y te dejen fuera\nEs donde deberías quedarte",
          "context": "Revelación de abuso. 'Needless beating' (golpiza innecesaria) puede ser físico o emocional, pero confirma la toxicidad extrema. El remate es brutal: 'Where you oughta stay' (donde deberías quedarte, en el suelo). Ya no hay compasión, hay venganza pasiva."
        },
        {
          "label": "VERSO 2 (CONT): LA SANGRE",
          "en": "And after all the blood that you still owe\nAnother dollar's just another blow\nSo fix your eyes and get up\nBetter get up while you can\nWhoa, whoa...",
          "es_text": "Y después de toda la sangre que aún debes\nOtro dólar es solo otro golpe\nAsí que arregla tu mirada y levántate\nMejor levántate mientras puedas",
          "context": "Escalada de costo. Cambia 'time' (tiempo) por 'blood' (sangre). La relación le ha costado vida. 'Another dollar's just another blow' conecta el dinero con el dolor físico. Le ordena levantarse ('get up') para que se vaya, no para ayudarla."
        },
        {
          "label": "CORO 2: REPETICIÓN",
          "en": "When you go, and would you even turn to say\n\"I don't love you like I did yesterday\"?",
          "es_text": "Cuando te vayas, ¿te girarías siquiera para decir\n\"No te amo como lo hice ayer\"?",
          "context": "Mantiene la pregunta. La insistencia en que la otra persona *diga* las palabras muestra que el protagonista necesita escuchar la confirmación para cerrar el ciclo."
        },
        {
          "label": "PUENTE: LA URGENCIA",
          "en": "Well, come on, come on",
          "es_text": "Bueno, ¡vamos, vamos!",
          "context": "Impaciencia pura. Ya no es tristeza, es prisa por que se acabe. Está echando a la persona activamente."
        },
        {
          "label": "CORO 3: LAS AGALLAS (GUTS)",
          "en": "When you go, would you have the guts to say\n\"I don't love you like I loved you yesterday\"?",
          "es_text": "Cuando te vayas, ¿tendrías las agallas de decir\n\"No te amo como te amaba ayer\"?",
          "context": "El cambio crítico. Cambia 'turn to say' por 'have the GUTS to say' (tener las agallas/huevos). Desafía la cobardía de la pareja. También cambia 'did' por 'loved', haciendo la emoción más explícita."
        },
        {
          "label": "OUTRO: LA SENTENCIA FINAL",
          "en": "I don't love you like I loved you yesterday\nI don't love you like I loved you yesterday",
          "es_text": "No te amo como te amaba ayer\nNo te amo como te amaba ayer",
          "context": "La respuesta. Al final, ya no es una pregunta hipotética ('Would you say...'). Es una afirmación. El protagonista asume la frase. El amor se ha evaporado. Es el punto final definitivo."
        }
      ]
    }
      




  ]
}
